Repository: kawad852/nashmi_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# generalErrorTitle
source: Something Went Wrong
ar: حدث خطأ ما

# generalErrorBody
source: An unexpected error occurred. Please try again later or contact support.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم.

# connectionErrorTitle
source: Connection Error
ar: خطأ في الاتصال

# connectionErrorBody
source: Unable to reach the server. Please check your internet connection and try again.
ar: تعذر الوصول إلى الخادم. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

source: Retry
ar: إعادة المحاولة

# serverErrorTitle
source: Data Unavailable
ar: البيانات غير متوفرة

# serverErrorBody
source: We're currently having trouble retrieving data from the server. Please try again later.
ar: نواجه حاليًا مشكلة في استرداد البيانات من الخادم. يرجى المحاولة مرة أخرى لاحقًا.

# generalError
source: Oops, Something went wrong !
ar: عذرًا، حدث خطأ!

# networkError
source: Internet Connection Error
ar: خطأ في اتصال الإنترنت

source: Confirm
ar: تأكيد

source: Welcome guest
ar: هلا بالضيف

source: Hello and welcome
ar: هلا ومرحبا

# joinUsButTellUsWhoYou
source: Please join us, but tell us who you are?
ar: تفضل فوت عنا ، بس خبرنا مين انت ؟

source: Your phone number
ar: رقم تلفونك

source: Your password
ar: باسووردك

source: Enter your password here
ar: ادخل باسووردك هان

source: Forgot your password?
ar: نسيت باسسوردك ؟

source: Welcome
ar: يا هلا تفضل

# dontHaveAccount
source: Don't you have an account?
ar: ما عندك حساب ؟

source: Create account
ar: اعمل حساب وعرفنا بحالك

# orPleaseLogThrough
source: Or please log in through
ar: او تفضل فوت عنا من هان

# searchCountryOrCode
source: Search for the country name or dial code
ar: إبحث عن إسم أو رمز البلد

# phoneNum
source: Phone number
ar: رقم الهاتف

source: Required field
ar: حقل مطلوب

source: Invalid email
ar: بريد إلكتروني غير صحيح

source: Invalid number
ar: الرقم غير صحيح

# passwordTooShort
source: Must be at least 6 characters
ar: يجب ان تتكون من ٦ رموز على الاقل

# passwordNotMatch
source: password Does not Match
ar: كلمة المرور غير متطابقة

source: Hello, dear
ar: هلا وغلا

# whatAreYouLooking
source: What are you looking for?
ar: على شو بتدور ؟

source: More
ar: شو في بعد

source: Official sponsors
ar: الرعاة الرسميين

source: What do we have?
ar: شو في عندنا ؟

# nashmi
source: dear
ar: بالنشمي/ ـة

# fillForm
source: Please fill out the following form to create your own account
ar: تفضل عرفنا بحالك ، معرفة الناس مكسب

# whatYourName
source: What is your name?
ar: شو اسمك ؟

# nameHintText
source: Enter your name here
ar: عاشت الأسامي مقدماً

source: Male or female
ar: نشمي ولا نشمية ؟

source: Male
ar: نشمي

source: Female
ar: نشميَّه

# doYouAgree
source: Do you agree to the
ar: موافق على

# termsAndPolicy
source: terms and conditions and privacy policy?
ar: الشروط والأحكام و سياسة الخصوصية ؟

# alreadyHaveAccount
source: Already have an account?
ar: احنا نعرفك من قبل ؟

source: Login
ar: ياهلا تفضل

source: Register
ar: والنّعم ، يا هلا

source: Back
ar: ارجع ورا

# receivedCodeOnYourPhone
source: You have received the code on your phone, please fill it in the following field
ar: وصلك كود على تلفونك اعطينياه ولا تهون

# codeHintText
source: Enter your code here
ar: اكتب الكود هان

# didntReceiveCode
source: Didn't receive the code? Send it again
ar: له له ما وصلك الكود ؟ ولا يهمك ارجع ابعثه مره ثانيه بعد

source: Enter the code
ar: تفضل الكود

# welcomeNashmi
source: Welcome
ar: والنّعم ، يا هلا

# helloHello
source: Hello, welcome
ar: هلا يا هلا

# thanksFollowing
source: Thank you for following. From now on, you can do anything with us in Nashmi Market however you want. Donâ€™t forget to see what happens to us on Nashmi Day.
ar: غلبناك معنا ، بس مثل ما قلتلك معرفة الناس مكسب هسا تقدر تسوي كل شي ودكياه عنا بسوق نشمي على كيفك ، ولا تنسى تشوف يوم نشمي شو يصير عنا

# cont
source: Continue
ar: تفضل فوت

source: Don't care
ar: ولا يهمك

# yaNashmi
source: dear
ar: يالنشمي/ ـة

# enterYourPhoneNumber
source: Please enter your phone number in the following field to identify you. We will send you a code to your phone
ar: بس اكتبلنا هان رقم تلفونك ، عشان نتعرف عليك رح نبعثلك كود على تلفونك

source: Send the code
ar: ابعث الكود

source: Like
ar: كفو

source: Add your rating
ar: اضف تقييمك

source: View ratings
ar: عرض التقييمات

source: Images
ar: صور

source: Address and location
ar: العنوان والموقع

source: Call directly
ar: اتصـال مباشرة

source: Most rated
ar: الأكثر تقييماً

source: Most likes
ar: الأكثر كفو

source: Nearest distance
ar: الأقرب مسافة

source: Favorites list
ar: قائمة المفضلة

source: Notifications
ar: اخر علومنا

# getKnowUs
source: Get to know us
ar: تعرف علينا

source: List
ar: القائمة

source: Terms and Conditions
ar: شروطنا واحكامنا

source: Privacy Policy
ar: سياسة الخصوصية

source: Talk to Nashmi
ar: احكي مع نشمي

source: Advertise with us
ar: اعلن عنا

source: Complaints and suggestions
ar: الشكاوي والإقتراحات

# participateNashmiMarket
source: Participate in Nashmi Market
ar: شارك بسوق نشمي

source: Edit account
ar: تعديل الحساب

source: Your current password
ar: باسووردك اللي هسا

source: Your new password
ar: باسووردك الجديد

source: Confirm new password
ar: باسووردك الجديد مره ثانية

source: Save modifications
ar: حفظ التعديلات

source: Edit image
ar: تغيير الصورة

# toContactNashmiMarket
source: To contact Nashmi Market management
ar: للتواصل مع ادارة سوق نشمي

# fillInfoToContactYou
source: Fill in your information and we will contact you as soon as possible
ar: عبي بياناتك هان واحنا رح نتواصل معك بأقرب وقت

# forComplaints
source: For complaints and suggestions
ar: للشكاوي والإقتراحات

# fillComplaintToContactYou
source: Fill out your complaint or suggestion here and we will contact you as soon as possible
ar: عبي شكوتك او اقتراحك هان واحنا رح نتواصل معك بأقرب وقت

source: Title
ar: الموضوع

source: Your message
ar: رسالتك

source: Message title
ar: عنوان الرسالة

# writeYourMessageHere
source: Write us your message here
ar: اكتبلنا رسالتك هان

source: Your complaint or suggestion
ar: شكوتك او اقتراحك

source: Attach pictures or files
ar: ارفاق صور او ملفات

source: Send
ar: ارسال

source: Nashmi Day
ar: يوم النشمي

source: Luxurious offers
ar: عروض فخمه

# remainingTimeOffers
source: Remaining time for offers
ar: الوقت المتبقي للعروض

source: Offer details
ar: تفاصيل العرض

source: Watch it now
ar: يشاهده الآن

# scanQR
source: Scan the QR code to take the offer
ar: امسح الـ QR Code عشان تاخذ العرض

source: sold
ar: تم بيع

# ofe
source: of
ar: من

# catchUpBeforeOfferOver
source: Catch up before the offer is over
ar: لحق حالك قبل ما يخلص العرض

source: Share
ar: علِّم الربع بالسالفة

# catchOffer
source: Let's catch the offer
ar: يلا نلحق العرض

source: Welcome to
ar: مرحبا بك في

source: Nashmi Market
ar: سوق نشمي

# commercialAndServiceFacilities
source: Commercial and service facilities in
ar: منشآت تجارية وخدمية في

# allRegionsAndGovernorates
source: In all regions and governorates It is
ar: في جميع المناطق والمحافظات

source: present
ar: موجود

source: Next
ar: التالي

# introDes0
source: Get ready for an ideal experience in seeking services from professionals And technicians simply with the click of a button.Browse professionals by ratings and check expertise And the skills and evaluations of each professional that he obtained through us
ar: استعد لتجربة مثالية في طلب الخدمات من المهنيين والفنيين بكل بساطة وبضغطة زر. تصفح المهنيين حسب التصنيفات وتحقق من خبرات ومهارات كل مهني وتقييماته التي حصل عليها من خلالنا

# introDes1
source: Restaurants, stores, commercial and service facilities can all be found here Only one place, Nashmi Market.Simply search and browse by departments and regions
ar: مطاعم، متاجر ، منشآت تجارية وخدمية جميعها تجدها في مكان واحد فقط سوق نشمي . ابحث وتصفح بكل بساطة حسب الأقسام والمناطق

# introDes2
source: Search from anywhere in the Hashemite Kingdom of Jordan for any A service or facility you need within the Hashemite Kingdom of Jordan simply.
ar: ابحث من اي مكان في المملكة الأردنية الهاشمية عن اي خدمة او منشئة تحتاجها داخل المملكة الأردنية الهاشمية بكل بساطة.

source: Skip
ar: تخطي

source: Invalid credentials
ar: بيانات غير صحيحة

source: Cancel
ar: إلغاء

# requireRecentLogin
source: This operation is sensitive and requires recent authentication. Log in again before retrying this request.
ar: هذه العملية حساسة وتتطلب مصادقة حديثة. قم بتسجيل الدخول مرة أخرى قبل إعادة محاولة هذا الطلب.

# deleteAccountSuccess
source: Your account has been deleted successfully.
ar: تم حذف حسابك بنجاح.

# authFailed
source: Authorization Failed
ar: خطأ في عملية التسجيل

source: Reviews
ar: التقييمات

# reviewSubmittedMsg
source: Your review has been submitted successfully
ar: تم إرسال تقييمك بنجاح

source: Comment
ar: التعليق

source: Submit
ar: إرسال

# termsMsg
source: to continue, must agree to terms and conditions
ar: للمتابعة، يجب الموافقة على الشروط والاحكام

# genderMsg
source: Select your gender
ar: اختر الجنس

# enterOtp
source: Enter pin code
ar: ادخل الرمز
